# # 1) SyntaxError
# # ეს შეცდომა ხდება როდესაც კოდი სინტაქსის წესებს არ აკმაყოფილებს. მაგალითად თუ დაივიწყებთ დახურულ ბრჭყალებს ან ითქმის არასწორად.
# print("Hello world)  # SyntaxError - ციტატების შეუთავსებლობა

# # 2) ValueError
# # ეს შეცდომა ხდება, როდესაც ფუნქციას ან ოპერაციას გადაეცემა არასაკმარისი ტიპის მონაცემი. მაგალითად  სტრიქონის ციფრად გარდაქმნა.
# number = int("hello") 

# # 3) IndexError
# # ეს შეცდომა ხდება როდესაც ეცდებით ელემენტის მიღებას არა არსებულ ინდექსზე სიაში ან ტუპლში.
# my_list = [1, 2, 3]
# print(my_list[5]) 

# # 4) TypeError
# # ეს შეცდომა ხდება როდესაც არასწორ ტიპებს შორის ოპერაცია ხდება. მაგალითად სტრიქონისა და რიცხვის დასანგრევად.
# result = "Hello" + 5  

# # 5) ZeroDivisionError
# # ეს შეცდომა ხდება როდესაც ეცდებით რიცხვის გაყოფას 0-ით.
# x = 5 / 0 
