#პროგრამირებაში sequence არის ძირითადი ალგორითმი: ლოგიკური ნაბიჯების ერთობლიობა, რომელიც შესრულებულია თანმიმდევრობით.
#  კომპიუტერებს სჭირდებათ ინსტრუქციები ალგორითმის სახით სასურველი დავალების შესასრულებლად და ამ ალგორითმს უნდა ჰქონდეს ნაბიჯების სწორი თანმიმდევრობა ან sequence

#Iteration  პროგრამირებაში ნიშნავს ნაბიჯების გამეორებას, ან ინსტრუქციების დახურვის ინსტრუქციის ერთჯერადი მოქმედება, რომელიც შეიძლება შესრულდეს კომპიუტერის პროცესორის მიერ, განმეორებით. 
# ამას ხშირად "Loop" უწოდებენ.

#პროგრამირებაში Selection გამოიყენება ინფორმაციის მიხედვით არჩევანის გასაკეთებლად ან განსახილველი პროცესის გადასატანად პროგრამის სხვადასხვა ნაწილში. შერჩევას ასევე უწოდებენ გადაწყვეტილებას.